org/Paper_Review.tex
% Created 2016-07-29 Fri 19:52
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Nathan}
\date{\today}
\title{Paper\_Review}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.50.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{I recognize but not 100\% understand (AKA squishy bio-stuff)}
\label{sec-1}
\begin{itemize}
\item Haplotypes (I assume this is a pretty straightforward thing for most biologists though right?)
\end{itemize}

\section{What is this? (AKA stuff I haven't heard off)}
\label{sec-2}
\begin{itemize}
\item Nucleotide
\item DHFR \& AIMP1 I've seen these mentioned but might just be going over my head
\item Same as above but Bowtie2?

\item Haplotype (I put this in twice because it's mentioned so much and changed what I thought I knew and is mentioned in more detail after a while)
\end{itemize}

\section{Grammar?}
\label{sec-3}


\subsection{Page 5}
\label{sec-3-1}
\begin{enumerate}
\item Diversity present in the enzymes and small petides in microbial communities \ldots{}
\label{sec-3-1-0-1}
This entire sentence is a little awkward to read, something more like: 
"Diversity in the enzymes and small petides found in microbial communities are a valuable\ldots{} "
\end{enumerate}

\subsection{Page 6}
\label{sec-3-2}
\begin{enumerate}
\item The problem of haplotype discover \ldots{} is a post-assembly problem
\label{sec-3-2-0-1}
Could be worded better, feels odd to read

\item There's a [?] that has no references yet to software that can perform these functions
\label{sec-3-2-0-2}
\end{enumerate}

\subsection{Page 8}
\label{sec-3-3}
There's a few areas on this page that have "\ldots{}" sections that I don't really understand these areas :s 
But I assume this is because they're unfinished so no need to worry 

\subsection{Page 10}
\label{sec-3-4}
\begin{itemize}
\item "Markov chain models .. have been proposed in 2006" Is the wording alright for that, wouldn't "were proposed by Wang in 2006\ldots{}"
\end{itemize}

\subsection{Page 11}
\label{sec-3-5}
\begin{itemize}
\item "The evidence on those reads" could make better sense as "The evidence on these reads"?

\item Silly little things in the bullet points like not having caps or periods on the sentences.

\item When talking about N haplotypes, possibly change it to the \mathbb{N} symbol to stand out a bit more?

\item What is the defining feature that Hansel and Gretel use to determine "too small to be useful" is it a hard \% of data. If so
\end{itemize}
how do you know it's safe to ignore / even consider in the first place

\section{General thoughts}
\label{sec-4}
I might be wrong, but doesn't anything between two ',' need to not be a requirement for the before and after parts of the sentence? 

\subsection{Page 5}
\label{sec-4-1}
\begin{itemize}
\item About midway through the page there is a bit about assembly of reads from metagenomes, another thing I'm most likely wrong about /
\end{itemize}
misunderstanding but it isn't clear if creating a reference from a metagenome refers to making one metagenomic sample a reference for other
unique samples or does the sample be used for itself? 

\subsection{Page 6}
\label{sec-4-2}
\begin{itemize}
\item Gene-level variation in genomes\ldots{} the margin of error given for contigs, is it worth giving a \% example here of the kind of accuracy you aim for regularly?
\end{itemize}
Especially if it is a low \% it would be good to have more figures! 

\begin{itemize}
\item Last sentence "Most existing haplotyping\ldots{} for single-species" isn't this a little bit repeated with what's written a few paragraphs ago
\end{itemize}
"Most assemblers are designed for single species genomes \ldots{} and aim to produce a single sequence". Might be worth while rewording slightly just to 
avoid sounding like repeating. I do realise it's slightly different but sounds very similar.  

\subsection{Page 8}
\label{sec-4-3}
\begin{itemize}
\item Is it worth while expanding upon / reworking the P(h1, h2 | M) so that it's easier to read?
\end{itemize}
All the data is there for the function but has explanation before and after? I could just be nitt picky on this 

\begin{itemize}
\item Maybe I missed something but last paragraph talks about "Wang" but there doesn't seem to be a mention of them before or decent explanation of their work.
\end{itemize}
Good chance that I'm wrong about this so perfectly happy for you to tell me I'm wrong on this

\subsection{Page 9}
\label{sec-4-4}
\subsubsection{More recent methods\ldots{}}
\label{sec-4-4-1}
This section is really nice to read and all of the stuff makes sense (to me, which is saying something)

\subsection{Pages 17-20}
\label{sec-4-5}
Explainations here are really good, the introduction of the diagrams really clear up. Picture == 1000 words and all that 

\section{Other}
\label{sec-5}

\subsection{General question on bacteria}
\label{sec-5-1}
Just a thought. Rumen has a load of stuff floating around and I was under the impression that these bacteria have a cool feature in that they can 
absorb/copy beneficial blocks of DNA from others. So is this something that affects these regions of interest?  

\subsection{Page 6}
\label{sec-5-2}

\begin{enumerate}
\item Gene level variation in metagenomes
\label{sec-5-2-0-1}
This section is really nice as it uses brackets to refer to stuff. 
It's just a bit of contrast to some other sections of the paper, where there is some lack of clarification. 
It goes from talking about the metahaplome with no explanation to saying that DNA sequences are reads?
\end{enumerate}
% Emacs 25.1.50.2 (Org mode 8.2.10)
\end{document}
